package kevin.chaos_monkey;
/**
 * 운영이슈 테스트
 *
 * Chaos Monkey 소개 / 넷플릭스에서 만든 툴
 *
 * 카오스 엔지니어링 툴.
 * 프로덕션 환경, 특히 분산 시스템 환경에서 불확실성을 파악하고 해결방안을 모색하는데 사용
 *
 * 운영환경 불확실성의 예
 * 1. 네트워크지연
 * 2. 서버 장애
 * 3. 디스크 오작동
 * 4. 메모리 누수 등..
 *
 * 카오스멍키 스프링부트
 * - 스프링부트에서 카오스멍키를 손쉽게 적용할 수 있는 툴
 * - 즉 스프링부트 애플리케이션을 망가트릴 수 있는 툴
 *
 * 카오스멍키 스프링 부트 주요개념
 *
 * 공격대상
 * 1. RestController, Controller
 * 2. Service, repository, component
 *
 * 공격유형
 * 1. 응답 지연
 * 2. 예외 발생
 * 3. 애플리케이션 종료
 * 4. 메모리 누수
 */
public class chaosMonkeyTest {
}
